[
{"Title": "Embedding data science at LSE", "Text": "Embedding data science at LSE  Professor Ken Benoit, Baroness Minouche Shafik, and Professor Susana Mourato introduce the DSI \n                                                     Watch the video", "URL": "#media"},
{"Title": "DSI News", "Text": "DSI News  DSI's inaugural Director, Professor Ken Benoit, steps down after four years", "URL": "/DSI/News/DSI-Announcement"},
{"Title": "Turing University Network", "Text": "Turing University Network  LSE part of a new network of UK universities with an interest in data science and AI", "URL": "/DSI/Turing-University-Network"},
{"Title": "Study Data Science and AI at LSE", "Text": "Study Data Science and AI at LSE  Explore all the options from undergraduate to online short courses and much more", "URL": "/DSI/study"},
{"Title": "BSc Politics and Data Science", "Text": "BSc Politics and Data Science  Combine rigorous training in political science with a good understanding of applied data science met", "URL": "https://www.lse.ac.uk/study-at-lse/Undergraduate/Degree-programmes-2022/BSc-Politics-and-Data-Science"},
{"Title": "Executive Courses", "Text": "Executive Courses  Leverage data science and AI to make informed, intelligent decisions", "URL": "https://www.lse.ac.uk/study-at-lse/executive-education/programmes/data-science-for-executives"},
{"Title": "Events", "Text": "Events  Explore all of our upcoming and past events", "URL": "/DSI/Events"},
{"Title": "Upcoming Event", "Text": "Upcoming Event  Beveridge 2.0: AI and Data Science for Public Policy Symposium \n                             Wed 8 May", "URL": "https://www.lse.ac.uk/school-of-public-policy/events/2023-24/Beveridge-2.0-AI-and-Data-Science-for-Public-Policy"},
{"Title": "Event Recording", "Text": "Event Recording  Developing AI Literacy in the classroom and beyond", "URL": "https://youtu.be/hwrvimZuU0w?si=tIrsFRqMvMn9ToOS"},
{"Title": "Event Podcast", "Text": "Event Podcast  What is means to be a human in a world changed by AI", "URL": "https://www.lse.ac.uk/lse-player?id=1ea831b4-3d9b-4109-bdbb-927cfcf6b740"},
{"Title": "Blog", "Text": "Blog  Exploring the potential of artificial intelligence as a student at LSE", "URL": "https://blogs.lse.ac.uk/studentsatlse/2024/04/10/exploring-artificial-intelligence-as-a-student-at-lse/"},
{"Title": "Blog", "Text": "Blog  What role should AI play in global health?", "URL": "https://blogs.lse.ac.uk/europpblog/2024/03/22/what-role-should-ai-play-in-global-health/"},
{"Title": "LSE Festival 2024", "Text": "LSE Festival 2024  AI guardians: who holds power over our data \n                             Sat 15 Jun", "URL": "https://www.lse.ac.uk/Events/LSE-Festival/2024/0615/AI"},
{"Title": "Generative AI and the Knowledge Economy", "Text": "Generative AI and the Knowledge Economy  24-25 May 2023 \n                                     Catch up on this two-day symposium co-hosted by Imperial College London and LSE", "URL": "https://www.imperial.ac.uk/data-science/partnerships/dsi-squared---imperial-x-lse/generative-ai-and-the-knowledge-economy-symposium/"},
{"Title": "\r\n\tEvents\r\n", "Text": "Browser does not support script. The DSI hosts a range of events including research seminars, workshops and showcases, public lectures, industry collaborations and careers seminars.       We organise a wide range of events for students, researchers and public audiences   AI Events at LSE  Past Event Highlights   London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/DSI/Events"},
{"Title": "\r\n\tBeveridge 2.0: AI and Data Science for Public Policy Symposium\r\n", "Text": "Browser does not support script. In a world increasingly shaped by digital transformation, AI and data science present new opportunities to change policymaking in nearly all areas of policy. Yet the capabilities of these emerging technologies are still unfolding and need to be better understood, both in terms of their benefits and their limitations. The Data Science Institute and the Beveridge 2.0 Programme collaborate in this symposium bringing together experts from a range of disciplines - from philosophy to statistics, government and law - to reflect together on future directions, applications, and consequences of the use of AI and data science. Emerging technologies can transform evidence-based policy development through their analytical capabilities, predictive powers, and real-time monitoring, while also bringing questions around regulation, transparency, accountability and ethics to the fore.   Wednesday 8th May 2024  Marshall Building, MAR 1.04, LSE   Arrivals and welcome   9.20-10.00      10.00-10.40   Session 1   (LSE DSI) – AI and the transformation of the social sciences  Discussant:   (Imperial College London)     (LSE Philosophy) - Transparency and explainability for AI models used in policy-making. Discussant:   (King’s College London)  Tea and Coffee Break  10.50-11.40  11.40-12.20 Session 2   (LSE Law) - The Need for a Digital Beveridge Report: Automated Public Decision Making and the Need for Regulation  Discussant:   (University of East Anglia)   (Essex) - Artificial Lawyers: Epistemology and Purpose of Law in Society   Discussant:  (King’s College London)   Lunch     14.00-14.40   Session 3    (LSE Government) – The promises and dangers of AI in election campaigning  Discussant:   (University of Birmingham)     (Oxford) and   (Alan Turing Institute) - Are all policymakers data scientists now? Data science and evidence in policymaking  Discussant:   (Birmingham)   Tea and Coffee Break 14.50-15.30    15.30-16.10    16.10-16.40  Session 4   (University of Greenwich) - Who should regulate AI applications in workplaces?  Discussant:   (University College London)      and   (LSE Statistics) Generative AI in education: catalyst or constraint? Insights from GENIAL to inform Higher Education policy. Discussant:   (University College London)   (LSE Health Policy) – What role should AI play in global health?  Discussant:   (Imperial)   Closing Remarks and Reception   is a programme hosted by the   that aims to bring the LSE community together with the intent of exploring important policy questions, fostering dialogue across disciplines and identifying avenues for collaborative cross-disciplinary research.   The   is an interdisciplinary institute established to foster the study of data science and new forms of data with a focus on their social, economic and political aspects. The   is an international community where ideas and practice meet. Our approach creates professionals with the ability to analyse, understand and resolve the challenges of contemporary governance. Share London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/school-of-public-policy/events/2023-24/Beveridge-2.0-AI-and-Data-Science-for-Public-Policy"},
{"Title": "\r\n\tAI guardians: who holds power over our data | LSE Festival\r\n", "Text": "Browser does not support script. Browser does not support script. \nIn-person and online public event (Marshall Building)                             Who is in charge of the algorithms and models that shape our future?   This event will explore ethics and bias in AI, and examine the need for diverse and inclusive data teams and decision-makers.   Kenneth Benoit ( ) is Director of the Data Science Institute at the London School of Economics and Political Science, and Professor of Computational Social Science in the Department of Methodology. He is also Professor (Part-time) in the School of Politics and International Relations, Australian National University. He has previously held positions in the Department of Political Science at Trinity College Dublin and at the Central European University (Budapest).  Eleanor Drage is a Senior Research Fellow at the University of Cambridge Centre for the Future of Intelligence, and teaches AI professionals about AI ethics on a M]aster’s course at Cambridge. She specialises in using feminist ideas to make AI better and safer for everyone. She is also currently building the world's first free and open access tool that helps companies meet the EU AI act's obligations. Eleanor is also the co-host of  , where she asks key thinkers 'what is good technology?'. She also does lots of presentations for young people and is a TikToker for Carole Cadwalladr's group of investigative journalists, 'The Citizens'.  Sadiqah Musa has over 12 years of experience in data and analytics. She started her career analysing seismic data as an Interpretation Geophysicist. With the desire to expand her knowledge and expertise, Sadiqah moved into customer and behavioural analytics. She is currently working as a Senior Analytics Manager at Trustpilot and is the founder - CEO at Black in Data where she is an advocate for increased representation of ethnic diversity within data.    Larry Kramer is President and Vice Chancellor of LSE. He is a renowned legal scholar and teacher, a former Dean of the Stanford Law School, and a former President of the William & Flora Hewlett Foundation.  This event is part of the LSE Festival: Power and Politics running from Monday 10 to Saturday 15 June 2024, with a series of events exploring how power and politics shape our world. Booking for all Festival events will open on Monday 13 May.  The   ( ) forms the institutional cornerstone of data science activity at LSE. Working alongside the academic departments across the School, the DSI's mission is to foster the study of data science and new forms of data with a focus on their social, economic, and political aspects. This event is free and open to all, but a ticket is required. Online booking for events in the LSE Festival will open on Monday 13 May 2024. For any queries contact us at  . Share This event will be streamed live on YouTube  \n\t \n   London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/Events/LSE-Festival/2024/0615/AI"},
{"Title": "\r\n\tThe Turing University Network\r\n", "Text": "Browser does not support script. Founded by the Alan Turing Institute in 2023, the network provides a structure for UK universities to facilitate better connections and collaboration with one another and showcase their data science/AI activity. It also provides universities with an opportunity to engage with various Turing departments and teams. The network is a key component of the   aimed at changing the world for the better with data science and AI. The  , created in 2015, is the national institute for data science and artificial intelligence and is based at the British Library.    The Turing has three ambitious goals: It has recently developed three grand challenges: LSE is one of 65 UK university members of the Turing University Network and the administration of this membership sits within the Data Science Institute. We plan to keep you updated on Turing events and funding schemes announced for academics and PhD students. We have put in place two roles, one academic and one administrative, who will oversee the management of this Network on behalf of LSE:    (Department of Statistics) is the Turing Academic Liaison and can be contacted at  .  is the Turing Administrative Liaison and can be contacted at  . If you are a member of staff at LSE and would like to receive updates regarding events and schemes that we and the Alan Turing Institute are organising then please send an email to Ginny Pavey on  . If you are a PhD student at LSE and would like to receive updates then please complete this very short form  . Turing organise and host a range of talks, workshops, seminars and conferences which colleagues can register to attend and / or participate in. The events are designed to teach, engage, and inspire people with all levels of data science and artificial intelligence experience. A full listing of events is available on the  . Many of Turing’s events are also recorded and you can browse the video archive on their  . Share London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/DSI/Turing-University-Network"},
{"Title": "What role should AI play in global health? | EUROPP", "Text": "\n     \n          | 14 shares\n       Estimated reading time: 6 minutes \n     \n          | 14 shares\n       Estimated reading time: 6 minutes Digital health technologies have become an important part of health care systems across the world. This rise in popularity reflects rapid advances in wireless technology and computing power as well as increasing interest in   in health care. Digital health technologies can be used for patients, health care professionals, health system managers and data services. They include   in public health interventions and for specific procedures or therapeutic purposes. They can be used in isolation or combined with other products such as medical devices and diagnostic tests. Other important digital health technologies are used in patient administrative and operational support systems. As recently as a few years ago, many countries did not have a strategy for digital health or explicit regulation around market access, safety and quality. Health policies did not address how to support the implementation and adoption of digital health technologies to move at scale. Furthermore, decision-making around digital health technologies tended to operate in silos, with privacy authorities thinking about data concerns independently from health authorities focusing on safety, quality and efficacy. Fragmented decision-making remains a challenge, but growing interest in the intersection between AI and health care has shifted the decision-making landscape and could in part address this. First, globally, many countries are taking a proactive approach with respect to AI but also a government-wide approach that brings key institutions and stakeholders together. Second, there is growing interest in how to think about regulating AI solutions in health care. Third, at the international level, the   and the   are actively informing this policy debate, creating a space for decision-makers to come together. With the continued growth in supply and demand for digital health technologies, coupled with the arrival of COVID-19, there is   in this area, across geographies, nationally and internationally. With all the potential opportunities of AI in health care, the fundamental question of whether it is a force for good remains. Any attempt to answer this question requires grounding in the following principles to support knowledge and evidence on the use of responsible AI. First, policymakers should have an understanding of the risk and functionality of AI solutions. For example, low risk could relate to simple monitoring or relatively higher risk around supporting diagnosis and  . Second, countries should have evidence standards for AI solutions in place. Health care economic evaluation provides methods to assess and evaluate the costs and benefits of medicines and medical technologies. In individual countries, health technology assessment bodies apply these methods to inform decisions around their use and adoption. For example, in the UK, the health technology assessment body – the National Institute for Health and Care Excellence – updated its Evidence Standards Framework to include the evidence requirements for  . Third, robust studies of AI are needed. Our recent work on how to establish standards in economic evaluations for AI is a step in this direction to improve the calibre and benchmark AI related research outputs. Fourth, AI in health care is an active area of ongoing learning, requiring ways to test solutions and its applications.   could bring many benefits in this respect. Potential actions include listening and engaging with the public about concerns, public reporting and monitoring of AI performance, setting out rules about data control, incentivising and overseeing adherence to responsible AI principles, and monitoring solutions and applications  . Finally,   will complement national efforts. This might include a focus on operationalising policies and codes of conduct that remove the unnecessary and unhelpful barriers to responsible AI while ensuring appropriate risk classification frameworks, mitigation measures and oversight are in place. As market activity continues to grow, tracking progress with the development of AI policy will improve our knowledge. International forums offer a space for sharing collective learning to identify policy responses, joint problem solving and co-ordination to mitigate barriers. AI has become the use case for ongoing collaboration and learning in global health. Indeed, this brings to the fore a notion articulated almost two decades ago around a model for continuous learning by the National Academy of Medicine –   – an approach that resonates when it comes to AI in health and is more pressing now than ever before. Divya Srivastava is a Guest Teacher in the Department of Health Policy at LSE. She is a health economist focusing on digital health, health financing and comparative health policy. Has any consideration been given to the fact that medical practice changes – so medical AI will need, as standard, to be able to un-learn previous knowledge – or that the data on which it is trained may well be biased (see Caroline Criado-Cortez’s Invisible Women)? \nIf not, why not? © LSE 2024", "URL": "https://blogs.lse.ac.uk/europpblog/2024/03/22/what-role-should-ai-play-in-global-health/"},
{"Title": "\r\n\tStudy\r\n", "Text": "Browser does not support script. The LSE Data Science Institute forms a nexus for teaching and learning in data science at LSE. These courses began in 2021/22 and are at the cutting edge of current data science concepts. Students can select new DSI undergraduate modules using LSE for You. This course is designed to introduce students to data science and its practice: how it works and how it can produce insights from social, political, and economic data. More information is available via the   and also: DS101A (Autumn Term)   and   page.  DS101W (Winter Term)   and   page. This course will cover the fundamentals of data, with an aim to understanding how data is generated, how it is collected, how it must be transformed for use and storage, how it is stored, and the ways it can be retrieved and communicated. More information is available via the   and also:  DS105A (Autumn Term)   and   page. DS105W (Winter Term)   and   page. LSE students can watch a video that outlines the content of DS105  . This module extends the foundation of probability and statistics with an introduction to the most important concepts in data science and applied machine learning, with social science examples. More information is available via the   and also:  DS202A (Autumn Term)   and   page. DS202W (Winter Term)   and   page. LSE students can watch a video that outlines the content of DS202  .   Key contact Got a question about the DSI? Get in touch with our   who will be happy to help current students at any stage of their LSE journey. Events In addition to opportunities to study, the DSI offers an   to give students the chance to benefit from world leading multidisciplinary expertise. These events include seminars, workshops, public lectures and careers networking sessions.  The   aims to provide a programme of study that combines data science, machine learning, statistics and mathematics. The programme uses a rigorous approach, has a mathematical focus and involves applying data science to the social sciences. The BSc Data Science will prepare students for further study, or for professional and managerial careers, particularly in areas requiring the application of quantitative skills. The programme also allows students to choose to study a specialist area according to your developing interests and career plans. Students will gain practical skills, theoretical knowledge and contextual information that will be excellent preparation quantitative careers in a range of industries.  Please send queries about this programme to the  . The   combines rigorous training in political science with a good understanding of applied data science methods, and an acquisition of the statistical and programming skills necessary to apply these methods to political data. The programme also allows students to study the politics of big data, social media and data science. BSc Politics and Data Science graduates will embark on a variety of careers. These include careers in the civil service, government and international organisations, with digital media firms, both on the data science and the political side of the operation, with regulators such as Ofcom, and organisations in the growing field of data journalism (e.g. FiveThirtyEight, Vox, Upshot, Guardian Data). Please send queries about this programme to the   and visit the   for more information.   The   provides a programme of study that is suitable for students of high ability, combining and relating mathematics and the theoretical foundations of data science, where we interpret ‘data science’ as a broad label, including topics such as machine learning and Artificial Intelligence (AI). The approach in the degree is characterised by mathematical rigour, combined with applications relevant for providing the tools to analyse and develop new techniques in data science and machine learning. The degree prepares students for further study or for professional and managerial careers, particularly in areas requiring the application of quantitative skills. Please send queries about the programme to the  .     The   offers training in data science methods, with a focus on statistical perspectives. The programme offers students a solid theoretical foundation of statistical methods, as well as machine learning and data mining methods, and enables them to gain knowledge and hands-on experience in using modern computational tools and platforms that process small and large scale data. Students can choose to specialise in advanced topics in statistics and computing, and acquire analytical and quantitative skills in special application domains, such as finance and risk management. Capstone projects provide the opportunity of working on a real-world data science problem in collaboration with a corporate partner.  Please send queries about this programme to the  .   The   offers students with a background in social sciences the chance to use data to answer social, economic or political questions using the tools of data analysis, data science and computation. The programme offers a series of courses in project-based programming, applied quantitative methods, and research principles in data science, designed for students without a formal computing or statistical background. Students will also have the opportunity to choose electives from other departments, reflecting their interests and backgrounds in a substantive research area. Capstone projects provide students with the opportunity to apply the technical skills they have learned to a project of their own design. Please send queries about this programme to the  .   The   is a social science programme which offers a critical, year-long exploration of the significance of data and information within contemporary societies and communications. At a time when intensive data-gathering about online activity is central to both business models and to governments’ strategies for understanding their citizens, the programme’s theoretical perspective on datafication is highly relevant, allowing students to understand, evaluate and respond to the social and political contexts of data production and analytics. You will also consider the cultural aspects of the role of data within everyday life. Please send queries about this programme to the  .   The   provides mathematically oriented students with the skills needed to apply mathematical methods to real-world problems faced by companies, governments and other institutions. The programme delivers practical training in modelling, along with the theory of mathematical optimisation, statistics, dynamic programming and other fundamental techniques, with specialised options including combinatorial optimisation, integer programming, and algorithmic data mining. Capstone projects offer students the opportunity to undertake a consultancy role in a host organisation, and provide a solution with tangible benefits to a problem faced by the organisation. Please send queries about this programme to the  .     The   is a programme designed to equip future health data analysts with the skills they need to interpret, analyse, assess, and evaluate health interventions, services, programmes, and policies. Students will be taught to use a range of statistical methods relevant to the context of health, including machine learning, data mining, artificial intelligence, and deep learning techniques. The specialised courses in the programme will also enable students to apply advanced methods of data science and statistics to investigate real world health policy questions. Please send queries about this programme to the   and the  .     The   is aimed at those who wish to develop their skills in the analysis of quantitative data to answer research questions on spatial and geographic social science topics. The programme will suit those interested in research for academic or policy purposes, have a background in economics or other quantitative social science and are interested in developing technical skills in analysis of spatial data. Skills in obtaining, managing, visualising and analysing data (data science) are in high demand and the programme combines a training in the application of these methods and the use of geographical information systems (GIS), with the chance to study topics in urban economics, economic geography, environmental economics or planning. The culmination of the programme is a dissertation in which you investigate your own research topic using the data science and GIS methods you have studied on the course. Please send queries about this programme to the  .      The   fosters a rigorous, interdisciplinary approach to public policy that tackles policy challenges with the tools and frameworks of political science, economics, econometrics and data science.    In a world of big data and rapid technological change, computer programming and quantitative skills play a key role in the programme designed to equip professionals with the core quantitative, technical and analytical tools to address modern policy challenges. Students will hone their quantitative and analytical skills, positioning them for a variety of technical, policy, strategy and leadership roles across Government, NGOs, IFIs and the private sector.   about the MPA Data Science for Public Policy. Please send queries about the programme to the  .   Discover how to use big data to make more intelligent decisions. A five-day on campus open programme in the heart of London.  Next start date: 3 June 2024   In addition to in-person study, LSE makes world-leading teaching and research accessible to a global audience through a comprehensive portfolio of online programmes. These programmes equip students with the knowledge and skills to advance in an ever-changing world.  take place over six months, part-time, and are project-based online programmes designed for career outcomes.  take place over six to ten weeks and provide the ultimate flexibility for professionals.  offer an immersive learning experience of specialised subjects and take place over three weeks.  open the door to world-class, transformative education for learners globally. Earn a University of London qualification with academic direction by LSE from anywhere in the world. Find the full range of online study opportunities in data  . LSE Summer School offers a broad set of courses across a variety of different disciplines, taught by leading scholars in their fields. Share London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/DSI/study"},
{"Title": "\r\n\tAn announcement from the DSI\r\n", "Text": "Browser does not support script. Professor Larry Kramer   Ken was one of the earliest proponents of setting up a School centre of data science, dating from 2015 when he designed and led LSE’s first interdisciplinary research unit in data science. He helped design the Data Science Institute during two years of a planning and working group, eventually being appointed in 2020 as the Director of the new institute. Ken built its structures, designed its modules, recruited its staff, and oversaw two moves since that time. Through his vision, the Data Science Institute has succeeded in embedding data science across research and teaching at LSE, developing specialist data science degrees and modules at both undergraduate and postgraduate level, leading LSE’s membership to the Turing University Network, launching a complementary alliance with the Data Science Institute at Imperial College London, and engaging leaders and changemakers with our events programme, with speakers including Sir Tim Berners-Lee, and industry leaders from the likes of DeepMind, TfL and the NHS. As Ken prepares to depart, the Institute is poised for its next phase of growth well-equipped to tackle the challenges of the AI and data revolution. With an interdisciplinary approach that melds data science methodologies with insights from the social sciences, the DSI is uniquely placed to influence both policy and public discourse so that AI serves as a force for good. This transition coincides with   assuming the role of President and Vice Chancellor at LSE. Larry formally began his role this month and will spearhead LSE’s ambitious strategy with respect to research, education, and global impact, as well as the positioning of the social sciences in today’s rapidly changing world. Understanding and influencing how recent advances in AI will affect the future development of humanity and society head-on is a core part of Larry’s mission, and so the importance of the DSI to that mission will only continue to grow in the coming years. Taking the reins as Interim Director is   from the Department of Mathematics. Martin will support the DSI for a year through its transition, while an external recruitment process takes place for a permanent Director. To confront both the challenges and opportunities presented by the AI revolution, the Institute has also created a new Deputy Director position to ensure that the DSI is equipped for the next stage of its development. Share London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/DSI/News/DSI-Announcement"},
{"Title": "Studying AI at LSE | Students@LSE", "Text": "\n     \n       Estimated reading time: 10 minutes \n     \n       Estimated reading time: 10 minutes Today, few shifts in technological advancements hold as much promise and potential as the rise of artificial intelligence. The rapid and extraordinary advancement we are seeing in this field provides huge opportunities to accelerate human progress, boost scientific discovery and improve the lives of people all around the world. Artificial intelligence can potentially make a difference in all aspects of our lives, from the mundane to the extraordinary – we can already see intelligent algorithms now powering powerful generative AI tools and virtual assistants, and autonomous vehicles navigating our streets. As a current postgraduate student pursuing an  , I was very keen on diving into artificial intelligence and my journey into this field has been quite enriching. I had the opportunity to enrol in the ST449 Artificial Intelligence course offered by the  , wherein I delved into a variety of topics including simple and advanced search algorithms, gameplay, constraint satisfaction problems (CSP), knowledge representation, supervised learning and reinforcement learning. Each module provided a comprehensive understanding of various concepts and methodologies to help shape our understanding of this dynamic field. For instance, in the introductory lecture, we were provided with the foundational concepts of artificial intelligence, examining two primary approaches: the top-down approach of using human cognition (where we try to imitate/exceed human intelligence) and the bottom-up approach (where we try to build something that’s intelligent using mathematics and logic). We also explored building intelligent and rational AI agents, starting off by using the classic example of a simple vacuum cleaner agent. This lecture was helpful in setting the foundation for exploration into the more advanced concepts. One of the projects that I undertook during the course included the creation of a strategic AI agent for the two-player hand game of chopsticks. By implementing sophisticated evaluation functions, I managed to elevate the agent’s winning rate to 96% against multiple bots, earning a distinction for this project. This experience emphasised the significance of algorithmic design and strategic thinking in AI development, thus helping me gain transferable skills that are applicable across various domains. I’m looking forward to leveraging my knowledge and skills in my career to make meaningful contributions in the field of data science using AI-driven solutions and decision-making. Apart from coursework, there are other opportunities provided by LSE’s Department of Statistics. Students currently enrolled in the ST456 Deep Learning course are participating in the ongoing  , which is focused on understanding how LSE students are (or are yet to) integrate AI chatbots like ChatGPT or Bard into their studies during the academic term. The project aims to fill a knowledge gap and obtain insights into possible future paths for education in light of these new technologies. I find this very inspiring – as academia explores the power of artificial intelligence in education, LSE strives to be at the forefront of shaping the future of learning, thus preparing students to thrive in an increasingly AI-driven world. With rapid advancements in artificial intelligence, we are on the brink of a revolution that is unparalleled in scope, surpassing even the transitions that came in the past with the shift to mobile or to the web. That’s what excites me – that the impact of AI is profound and far-reaching for everyone. The boundary of what’s possible is constantly being redefined; therefore, it is crucial that we thoroughly understand the opportunities and risks that come with this new era of technological advancement. Through hands-on projects, collaborative discussions and a spirit of curiosity we can all unlock the true potential of AI to shape a better future.   Hi! I'm an MSc Data Science student at the Department of Statistics with a background in statistics and computer science. My interests lie in artificial intelligence, data analysis and content curation. When I'm not analysing numbers, I spend my time dancing, cooking or travelling around London.  Required fields are marked              © LSE 2024  has blocked   access attempts in the last 7 days.", "URL": "https://blogs.lse.ac.uk/studentsatlse/2024/04/10/exploring-artificial-intelligence-as-a-student-at-lse/"},
{"Title": "Data Science and AI for Executives On Campus Programme | LSE Executive Education", "Text": "Discover how to use data science and AI to make more intelligent decisions Statistical analysis and data management are transforming decision-making in just about every field of private and public life. But how do you distinguish between good data science and bad? This fast-paced, intensive programme gives you a comprehensive, non-practitioner grounding in data science, AI and machine learning. You will also explore its real-world application across business, government and law. Emerge with the understanding and vocabulary to assess quantitative evidence, design big data studies and make more intelligent, data-driven decisions. An intensive, empowering learning experience for you. Strategic impact for your organisation.   Faculty Overview | Data Science for Executives Participant Experience | Data Science and AI for Executives What are Large Language Models? How can we use AI ethically? Dr Edgar Whitley on Data Sharing Detecting the Sentiment of Text About LSE Executive Education Data Science and AI for Executives is an intensive, five-day learning experience that expertly integrates academic theory and hands-on, practical business application of the concepts and ideas explored. The programme brings together executives and decision-makers from a broad diversity of sectors, organisations and geographies at the LSE campus in central London. Together you will explore the concepts using contemporary case studies, demonstrations, group work discussion and highly interactive sessions with faculty. You also benefit from a full glossary of terms and vocabulary and direct access to four expert practitioner guest speakers who will present work from a variety of applied fields in data science. The programme is led by LSE faculty, who are global thought leaders in data science and statistical analysis. View the provisional programme timetable below: Sign up to get more information about Data Science and AI for Executives \" Six months on from the programme, it’s already had a big impact on my work. I’m speaking the language of a quantitative analyst and I can’t put a price on the confidence that’s given me in my conversations. \" Muzz Adams ,  Head of Performance, Investec Asset Management At LSE, we understand the complex interconnectedness of the challenges facing our world. As Europe’s foremost social science university, we know that it is only by managing this interconnectedness that you can secure sustainability and success in business. All of our world-class programmes for leaders leverage the fullest benefits of our renowned, interdisciplinary expertise – the psychology, the finance, the economic dimensions, and the interplay between them that underscores global business. You emerge with the fully rounded understanding, the integrated mindset and the leading-edge strategic tools to navigate complexity and spearhead meaningful change.   The programme is taught by world experts in data science and AI.   Professor  Kenneth Benoit Professor of Computational Social Science and Director of the LSE Data Science Institute Dr  Edgar Whitley Associate Professor of Information Systems, Department of Management Professor  Sabine Benoit Professor of Marketing, University of Surrey Find out both how to transform businesses with AI as well as the associated risks The Department of Management at LSE is a world-class centre for research and education in business and management, that draws fully on the LSE tradition of inter-disciplinary academic excellence. Ranked #2 worldwide for business and management by the QS World University Rankings 2019, the department informs and inspires the very best in management in practice by challenging and enhancing understanding of people, teams, organisations and markets, as well as the economic, psychological, social, political and technological contexts in which they operate worldwide.  This covers all tuition, course materials, daily lunches and networking events. You will receive an LSE certificate of completion at the end of the course.   All LSE executive education participants are required to have: 1 week, full-time Build the understanding, master the frameworks and learn to speak the language of finance  On campus 1 week, full-time Build the knowledge to navigate the road ahead with confidence and clarity.  On campus LSE is a private company limited by guarantee, registration number 70527. © LSE  2024", "URL": "https://www.lse.ac.uk/study-at-lse/executive-education/programmes/data-science-for-executives"},
{"Title": "\r\n\tData Science Institute\r\n", "Text": "Browser does not support script. The Data Science Institute (DSI) is an interdisciplinary institute established to foster the study of data science and new forms of data with a focus on their social, economic and political aspects. Watch the video Events, Podcasts, Blogs Catch up on this two-day symposium co-hosted by Imperial College London and LSE   Sign up to our newsletter to receive updates on all our activities Follow us on X (Twitter) Follow us on LinkedIn Subscribe to our YouTube channel A partnership between the Data Science Institutes at Imperial College London and LSE An LSE100 course offered to all first-year undergraduate students at LSE One of the LSE Student Union's premier societies Annual Report 2020-2023 \n             \n         \n             \n         \n                Floor 1, Columbia House, Houghton Street, London, WC2A 2AE\n             London School of Economics and Political Science Houghton Street London WC2A 2AE UK   LSE is a private company limited by guarantee, registration number 70527. +44 (0)20 7405 7686 © LSE 2024 Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script. Browser does not support script.", "URL": "https://www.lse.ac.uk/DSI"},
{"Title": "BSc Politics and Data Science - LSE ", "Text": "What are the risks posed by AI? What role does social media play in our democracy? What can be done about online hate speech? Data and digital technologies have changed the face of politics – creating a demand for graduates who can navigate these challenges. This programme will equip you with those skills. You’ll study how governments and policymakers acquire and use big data and how politicians draw on data to reach voters online. You’ll also look at the potential risks posed by AI to our political systems – and how AI can be used to benefit society. This\ndegree will equip you with the statistical and programming skills needed for a\nfuture career in politics and data science. As you progress, you’ll draw on\nexpertise from across LSE – including the state-of-the-art  . A unique feature is the third-year project with a partner organisation. You’ll apply science methodologies to a real-world challenge, working with advocacy groups, NGOs, think tanks and other organisations. This degree will prepare you for a host of careers in different areas, including digital and social media firms, the Civil Service, government, data journalism, regulation and political risk analysis and forecasting. Here, you can check our entry requirements for GCSEs, A-levels (please read them alongside our information about subject combinations) and the International Baccalaureate (IB) Diploma. We also consider applications from students with a range of   and from overseas. Please select the overseas button below and choose your country from the dropdown list to find the equivalency to A-levels of your qualification. For GCSEs, you’ll need a strong pre-16 academic profile such as several GCSE grades of A (or 7) and A* (or 8-9). We also ask for a good set of GCSE grades or equivalent across a broad range of subjects, with a minimum of grade B (or 6) in GCSE English and Mathematics. AAA, with an A in Mathematics We also consider your AS grades, if available. AAB, with an A in Mathematics Read our   to learn more about contextual admissions. . 38 points overall, with 766 at higher level, including higher level Mathematics 37 points overall, with 666 at higher level, including higher level Mathematics Read our   to learn more about contextual admissions. We\nwelcome students from all walks of life at LSE. We want to recruit students\nwith the very best academic merit, potential and motivation. So, whatever your\nbackground, please do apply. Get all the details on our general  . Competition for places at LSE is high. We cannot guarantee you an offer of a place even if you’re predicted or achieve our standard entry requirements. Our standard offer requirements are intended only as a guide and, in some cases, you’ll be asked for different grades. Discover more about our students and department. The Department of Government is an internationally renowned centre for teaching and research on politics and government. Within our department, we have 850 undergraduates, postgraduates and research students and more than 40 faculty staff – who come from 80 countries. Our research focuses on six main areas: The department’s work covers national, sub-national and global politics – with a strong emphasis on public-facing research. Teaching within the department draws on these strengths and our central role in a prestigious social science institution. As a student, you’ll learn from internationally renowned academics and study in the heart of London, close to the UK’s political heartland in Westminster and the Houses of Parliament. Our students gain the knowledge and skills to become sharp-minded critical thinkers who apply diverse analytical perspectives to political issues and conflicts around the globe. We encourage students to reflect on what it means to be responsible for addressing urgent public problems and engage in these issues in practical ways to prepare for their future careers. Our graduates find fulfilling roles in government, financial and professional services, teaching and research. Learn more about our  ,  . We consider each application carefully, taking into account all the details you’ve included on your UCAS form, such as: You may also have to provide evidence of your English proficiency, although this is not needed at the application stage.  . We’re looking for students who demonstrate: The\n  shows the latest tuition fees for all programmes. You're charged a fee for each year of your programme. Your tuition fee covers registration and examination fees payable to the School, lectures, classes and individual supervision, lectures given at other colleges under intercollegiate arrangements and, under current arrangements, membership of the Students' Union. It doesn't cover living costs or travel or fieldwork. Your tuition fees, and eligibility for any financial support, depend on whether you’re classified as a home or an overseas student – known as your fee status. We assess your fee status based on guidelines from the UK Government’s Department for Education. Learn more about  . We recognise that the cost of living in London may be higher than in your home town or country. LSE provides generous financial support, in the form of bursaries and scholarships, to UK, EU and overseas students. Additionally, the UK Government provides loans to UK and some EU students. Some overseas governments also offer funding. .  you’ll take part in lectures and related classes, as well as computer lab work, totalling between 10 to 15 hours per week. Lectures are given by full-time members of staff. Classes are held in small groups (with a maximum of 15 students). These are led by teaching fellows, who may either be recent doctoral degree recipients or PhD students. Learn about the teacher responsible for each course in the relevant  . You’ll also need to complete considerable independent study, including watching recorded short videos, formative and summative coursework and other activities. Hours vary according to the course. Get a broad idea of the study time involved in the   within the Teaching section of each  . you’ll meet with your academic mentor regularly to discuss your work. Your mentor can provide advice and guidance on academic issues and, where appropriate, personal concerns. at LSE, we offer lots of opportunities to extend your learning outside the classroom.  is a great place to get advice and practise the skills you’ll need during your studies and beyond. Through LSE LIFE, you can: we want all LSE students to achieve their full potential. Students can access free, confidential advice through our  . This is the first point of contact for students. We use a wide range of formative and summative assessment methods, including research design exercises, essays, exams, individual and group presentations and a team-based project. The degree award is determined by your work across all three years, particularly the second and third years. See the current formative coursework and summative assessment for each course in the relevant  . Politics graduates have a range of skills and can fit into a variety of positions in modern life. Our former students have followed careers in business and banking, in law, in central and local government, in teaching and research, in public and university administration, and in journalism and television. From CV workshops through to careers fairs, LSE offers lots of information and support to help you make that all-important step from education into work. Many of the UK’s top employers give careers presentations at the School during the year and there are numerous workshops covering topics such as job hunting, managing interviews, writing a cover letter and using LinkedIn. See   for further details. Every undergraduate programme of more than one year duration will have Discover Uni data. The data allows you to compare information about individual programmes at different higher education institutions. Programmes offered by different institutions with similar names can vary quite significantly. We recommend researching the programmes you're interested in and taking into account the programme structure, teaching and assessment methods, and support services available.", "URL": "https://www.lse.ac.uk/study-at-lse/undergraduate/bsc-politics-and-data-science"}
]